package lesson_1;

/*public class Main {
    public static void main(String[] args) {
       //Задача 3. Дано: Голодный Вася съедает за 9 минут 3 банана, а сытый за 15 минут,
        // насколько быстрее голодный Вася съедает один банан?
     /*   int a = 9;
        int b = 15;
        int c = 3;
        int d;
        d = b/c - a/c;
        System.out.println(d);
    }
}*/
            //Задача 4. Закомментируй часть кода, чтобы на экран вывелось сообщение "sum = 12"
/* public class Main {
    public static void main(String[] args) {
                int a = 3;
                //  int a = 10;
                int b = 6;
                //  int b = 12;
                //  int sum = 1 + a + b;
                //  int sum = 2 + a + b;
                int sum = 3 + a + b;
                //  int sum = 4 + a + b;
                System.out.println("sum = " + sum);
    }
}
*/
//Задача 5. В методе main расставь правильно знаки плюс и минус, чтобы значение переменной result получилось равным 20.
//        Знаки нужно расставить только в строчке, в которой объявляется переменная result.
//        Порядок следования переменных в этой строке изменять нельзя.
//        Перед каждой переменной должен стоять знак либо плюс, либо минус.
/*
public class Main {
    public static int a = 1;
    public static int b = 3;
    public static int c = 9;
    public static int d = 27;

    public static void main(String[] args) {

        int result = - a + b - c + d;

        System.out.println(result);
    }
}
*/
